#include <stdio.h>

int main(void) {

	//비트 연산자
	//비트끼리 연산하는 연산자
	//비트(bit) : 2진수의 1자리값 (0, 1)
	//비트 연산자의 종류
	// &  : 비트 AND
	// |  : 비트 OR
	// ^  : 비트 XOR
	// << : 비트 왼쪽이동
	// >> : 비트 오른쪽이동
	int num1 = 5;  	// 00000000 00000000 00000000 00000101
	int num2 = 3;  	// 00000000 00000000 00000000 00000011
	int result = 0;

	//비트 AND : 같은 비트 자리끼리 AND
	result = (num1 & num2);
	// 00000000 00000000 00000000 00000101
	// 00000000 00000000 00000000 00000011  &
	// 00000000 00000000 00000000 00000001
	printf("%d\n", result);  //  1

	//비트 OR : 같은 비트 자리끼리 OR
	result = (num1 | num2);
	// 00000000 00000000 00000000 00000101
	// 00000000 00000000 00000000 00000011  |
	// 00000000 00000000 00000000 00000111
	printf("%d\n", result);  //  7

	//비트 XOR : 배타적 OR, 입력이 다를때만 결과가 1 (eXclusive OR)
	// 0 ^ 0 : 0
	// 0 ^ 1 : 1
	// 1 ^ 0 : 1
	// 1 ^ 1 : 0
	result = (num1 ^ num2);
	// 00000000 00000000 00000000 00000101
	// 00000000 00000000 00000000 00000011  ^
	// 00000000 00000000 00000000 00000110
	printf("%d\n", result);  //  6

	//비트 반전 연산자
	num1 = ~num1;
	//num1의 비트를 반전시킨 다음 다시 저장
	// 00000000 00000000 00000000 00000101  ~
	// 11111111 11111111 11111111 11111010
	printf("%d\n", num1);  //  -6

	return 0;

}